index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-04 Sat 19:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HackTheOxidation</title>
<meta name="description" content="HackTheOxidation's Codeberg pages
Header" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/firacode@6.2.0/distr/fira_code.css">
<link rel="stylesheet" type="text/css" href="https://distro.tube/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://distro.tube/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://distro.tube/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://distro.tube/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">HackTheOxidation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org19db676">Skills/Interests</a>
<ul>
<li><a href="#org38ede53">Operating Systems</a></li>
<li><a href="#orgdedddb6">Programming Languages</a></li>
<li><a href="#orgc2aa3d5">Frameworks/Tools</a></li>
<li><a href="#org186789b">General Programming Concepts</a></li>
<li><a href="#org3d39fa1">Text Editors, IDE's and Other Tools</a></li>
<li><a href="#org7074d7b">Currently Learning/Playing with</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="orgyeah-header">
  <div class="topbar-menu-container">
    <span class="topbar-menu"><a class="current" href="https://hacktheoxidation.codeberg.page">Home</a></span>
    <span class="topbar-menu"><a href="https://codeberg.org/HackTheOxidation">Codeberg</a></span>
    <span class="topbar-menu"><a href="https://crates.io/users/HackTheOxidation">Crates.io</a></span>
    <span class="topbar-menu"><a href="https://pypi.org/user/HackTheOxidation">PyPI.org</a></span>
  </div>
</div>
<p>
Greetings Traveller!
</p>


<p>
Welcome to HackTheOxidation's Codeberg pages, a peaceful place in the vastness of cyberspace.
</p>

<p>
I'm a software engineering student and free/open-source software enthusiast among other things.
</p>


<p>
This site is still under construction at the moment (seriously, when are you ever done with a software project?).
</p>

<p>
In the mean time, check out my projects:
<a href="https://codeberg.org/HackTheOxidation">My Git repository on codeberg.org</a>
</p>

<div id="outline-container-org19db676" class="outline-2">
<h2 id="org19db676">Skills/Interests</h2>
<div class="outline-text-2" id="text-org19db676">
<p>
Most of the skills that I have acquired primarily come from University and (mostly) free-time hobby coding,
but in spring of 2022 I got an internship working on a (quite large) python project, so now I also have real-world
professional developer experience. Yay!
</p>
</div>

<div id="outline-container-org38ede53" class="outline-3">
<h3 id="org38ede53">Operating Systems</h3>
<div class="outline-text-3" id="text-org38ede53">
<ul class="org-ul">
<li>Linux - I have tinkered with most of the main distros: Debian-/Ubuntu-based, Fedora/RHEL, Arch-based, Gentoo-based etc.
and some niche stuff: Artix, GNU Guix, Void Linux, etc. I am currently running Arch as my main distro.</li>
<li>BSD - I have also had my hands in some of the BSD-derivatives, mainly FreeBSD and OpenBSD.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdedddb6" class="outline-3">
<h3 id="orgdedddb6">Programming Languages</h3>
<div class="outline-text-3" id="text-orgdedddb6">
<ul class="org-ul">
<li>Python - My first internship was all about python (django, specifically),
which means that I have "Professional" python development experience.
The code I wrote for the 'os2datascanner' project during my internship is fully open source!
Check it out here: <a href="https://github.com/os2datascanner/os2datascanner">os2datascanner</a>
Aside from that, I have used python in non-professional capacity as well,
mostly in the form of small scripts and config files, but now I am writing
bindings for my moonalloy project: <a href="https://codeberg.org/HackTheOxidation/python-moonalloy">python-moonalloy</a>.
In case your are familiar with the UniProt protein database, I wrote a CLI for fetching data: 
<a href="https://codeberg.org/HackTheOxidation/uniprot-cli">uniprot-cli</a>.</li>
<li>C - I have around 1.5 years under my belt from university and hobby coding.
I wrote a minimalist web-server for a project: <a href="https://codeberg.org/HackTheOxidation/ficus">ficus</a></li>
<li>C++ - I know advanced parts of the language from newer standards (C++17/20).
I wrote a small JSON-parser from scratch: <a href="https://codeberg.org/HackTheOxidation/picoJSON">picoJSON</a>.
And a library for parsing .INI-files: <a href="https://codeberg.org/HackTheOxidation/libini">libini</a>.</li>
<li>Haskell - This language is awesome! Being purely functional, it challenges the way you think and makes you a better programmer (I think).
I wrote a few of the challenges from Advent of Code 2021 in haskell: <a href="https://codeberg.org/HackTheOxidation/advent-of-code2021">advent-of-code2021</a>.</li>
<li>Rust - I have put a reasonable effort into learning it and it has quickly become one of my favorite programming languages.
I have written a small 'ls'-clone: <a href="https://crates.io/crates/neols">neols (crates.io)</a>.
I am also working on a numpy-like library written in rust with an API in Python and Lua (still in early development):
<a href="https://codeberg.org/HackTheOxidation/moonalloy">moonalloy</a></li>
<li>Go - I generally find Go to be a nice, minimalistic language.
I have done some tinkering with it and written (a very incomplete) cli-based http-client: <a href="https://codeberg.org/HackTheOxidation/twig">twig</a>.
I also began working on how to extract text from a PDF at work.</li>
<li>HTML, CSS - Used for making the previous version of this retro, non-bloated website.
Now, everything is written in the awesome <a href="https://orgmode.org">org mode</a>.</li>
<li>Emacs Lisp - It's just cool and retro and I can make my editor do anything with it.
I have contributed a few lines to <a href="https://github.com/Silex/docker.el">Silex/docker.el</a>.</li>
</ul>

<p>
And there are some more languages, but I have an opinion about these:
</p>

<ul class="org-ul">
<li>JavaScript/TypeScript - I know enough to survive, but I don't really enjoy it&#x2026;</li>
<li>C# - No. Just No&#x2026;</li>
<li>Anything proprietary - Seriously, open source is the way to go.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc2aa3d5" class="outline-3">
<h3 id="orgc2aa3d5">Frameworks/Tools</h3>
<div class="outline-text-3" id="text-orgc2aa3d5">
<ul class="org-ul">
<li>git (of course)</li>
<li>django (full-stack, including django templates)</li>
<li>pytest and various other python packages</li>
<li>Docker</li>
<li>GitLab CI/CD</li>
<li>Databases - mostly PostgreSQL</li>
<li>gunicorn and uvicorn</li>
<li>RabbitMQ (through pika.py)</li>
<li>Grafana</li>
<li>Nginx</li>
</ul>
</div>
</div>

<div id="outline-container-org186789b" class="outline-3">
<h3 id="org186789b">General Programming Concepts</h3>
<div class="outline-text-3" id="text-org186789b">
<ul class="org-ul">
<li>Data Structures and Algorithms - I have some implementations in C/C++ from a previous course:
<a href="https://codeberg.org/HackTheOxidation/DOA%22">Repository</a></li>
<li>Linux Kernel Modules and Operating System concepts.</li>
<li>Concurrency - Threads, Mutexes, Semaphores.</li>
<li>Object-Oriented Programming - Classes, Objects, Inheritance, Polymorphism, Interfaces, Design Patterns:
Observer, Singleton, Mediator etc.</li>
<li>Functional Programming - Typeclasses, Higher-order functions, Recursion etc.</li>
</ul>
</div>
</div>

<div id="outline-container-org3d39fa1" class="outline-3">
<h3 id="org3d39fa1">Text Editors, IDE's and Other Tools</h3>
<div class="outline-text-3" id="text-org3d39fa1">
<ul class="org-ul">
<li>I used to be a serious vimmer, but these days I mostly use Emacs.
I still like vim and use it occasionally, so don't think I want to start a war.
You can get my dotfiles <a href="https://codeberg.org/HackTheOxidation/dotfiles">here</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org7074d7b" class="outline-3">
<h3 id="org7074d7b">Currently Learning/Playing with</h3>
<div class="outline-text-3" id="text-org7074d7b">
<ul class="org-ul">
<li>Functional programming with languages like Haskell, Lisp and <a href="https://leanprover.github.io/">lean4</a></li>
<li>Everything Python! Even though it is not my favorite language
the more I use it, the more I like it (I might be turning into a true Pythonista).</li>
<li>Learning how to write Assemblers, Compilers and Interpreters</li>
<li>The Foundations of Computer Science.</li>
</ul>


<p>
BTW, The theme for this website is originally made by the awesome <a href="https://distro.tube/index.html">Derek Taylor aka. DistroTube</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-02-04 Sat 19:25</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
